{
  "backend/main.mo": "Main Motoko actor implementing a per-user notes app with CRUD operations, user profiles, blob storage, and access control via authorization mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (image encryption, hidden thumbnails, decryption UI, form editing) to their source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary of short summaries for each frontend source file, describing the purpose and notable recent changes of each module.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes used throughout the app.",
  "frontend/index.html": "Minimal HTML entry point that mounts the React app into a root div and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that handles Internet Identity authentication, forces dark mode, guards profile setup, and renders either the login screen or the notes dashboard.",
  "frontend/src/components/FullScreenImageModal.tsx": "Portal-based full-screen image viewer with capture-phase Escape handling and pointer event isolation to prevent click-through to underlying modals.",
  "frontend/src/components/NoteCard.tsx": "Note card component showing title, content preview or encrypted ciphertext, timestamp, and edit/delete actions; hides image count badges for encrypted notes.",
  "frontend/src/components/NoteDetailModal.tsx": "Modal component for viewing a note's details, supporting password-based decryption of encrypted notes, image viewing, deletion, and navigation to the edit form.",
  "frontend/src/components/NoteFormModal.tsx": "Modal form for creating or editing notes, with support for encryption, image attachments, text file import, and pre-populated decrypted content when editing encrypted notes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts new users to enter their name and create a profile on first use of the app.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, login, and logout via AuthClient.",
  "frontend/src/hooks/useNotes.ts": "React Query hooks for listing, fetching, creating, updating, and deleting notes via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "React Query hooks for fetching and saving the authenticated caller's user profile via the backend actor.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines dark-mode CSS custom properties for the design system.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/screens/LoginScreen.tsx": "Full-page login screen displaying the app logo and a Sign In button that triggers Internet Identity authentication.",
  "frontend/src/screens/NotesDashboard.tsx": "Main dashboard screen displaying a searchable grid of notes with modals for creating, viewing, and editing notes, plus a logout button in the header.",
  "frontend/src/utils/cryptoNotes.ts": "Provides AES-GCM password-based encryption/decryption utilities for both text content and raw image bytes using PBKDF2 key derivation via the Web Crypto API.",
  "frontend/src/utils/imageAttachments.ts": "Validates image file type (JPEG/PNG/GIF) and size (max 10MB), and provides a helper to generate a base64 data URL preview from a File object.",
  "frontend/src/utils/noteSearch.ts": "Exports a single `filterNotes` function that filters a list of notes by matching a query string against note titles and content (case-insensitive).",
  "frontend/src/utils/safeErrorReason.ts": "Extracts a short, user-friendly error message from unknown error values, normalizing common patterns like network errors, timeouts, and permission issues.",
  "frontend/src/utils/txtImport.ts": "Reads a `.txt` file using FileReader and returns its text content as a string, rejecting non-text files.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, border radius variables, Inter font, accordion animations, and plugins for typography, container queries, and animate.",
  "project_state.json": "Tracks the project state for an encrypted notes app, listing completed features (image encryption/decryption in cryptoNotes, NoteCard, NoteDetailModal, NoteFormModal) and a pending feature request to encrypt images alongside text."
}