{
  "backend/main.mo": "Motoko canister managing authorization, user profiles, and per-user note CRUD with timestamp sorting and image references.",
  "feature_evidence.json": "Feature evidence report mapping fullscreen preview requirements to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference in build planning.",
  "frontend/index.css": "Tailwind base and dark-mode color tokens using OKLCH variables for consistent theme styling.",
  "frontend/index.html": "Basic HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component handling authentication, profile setup flow, dark mode, and navigation to dashboard.",
  "frontend/src/components/FullScreenImageModal.tsx": "Portal-based fullscreen image viewer with escape/backdrop/click isolation and top-layer event handling.",
  "frontend/src/components/NoteCard.tsx": "Card UI showing note metadata, preview, encryption state, and inline edit/delete actions with safe event handling.",
  "frontend/src/components/NoteDetailModal.tsx": "Displays detailed view of a note with decryption, image preview, and delete functionality in a modal.",
  "frontend/src/components/NoteFormModal.tsx": "Provides a modal form for creating or editing notes with encryption, image uploads, and text import support.",
  "frontend/src/components/ProfileSetupModal.tsx": "Simple modal prompting new users to enter and save their display name.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, stored identities, and provides login/logout functionality via context.",
  "frontend/src/hooks/useNotes.ts": "React Query hooks to list, fetch, create, update, and delete notes using the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the caller’s user profile with automatic query invalidation.",
  "frontend/src/index.css": "Tailwind setup defining base styles and dark mode color variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, and Internet Identity provider.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen that triggers Internet Identity authentication and shows progress feedback.",
  "frontend/src/screens/NotesDashboard.tsx": "Main dashboard UI that lists notes, supports searching, creating, viewing, and editing notes, and handles loading and logout.",
  "frontend/src/utils/cryptoNotes.ts": "Implements password-based AES-GCM encryption and decryption for note content using Web Crypto API.",
  "frontend/src/utils/imageAttachments.ts": "Validates image file type/size and generates base64 previews using FileReader.",
  "frontend/src/utils/noteSearch.ts": "Filters notes by matching query text against note titles and content.",
  "frontend/src/utils/safeErrorReason.ts": "Converts unknown errors into short, safe user-facing messages.",
  "frontend/src/utils/txtImport.ts": "Reads and returns plain text from .txt files using FileReader with validation.",
  "frontend/src/utils/urlParams.ts": "Handles extracting, storing, retrieving, and clearing URL and session-stored parameters for app state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme colors, typography, animations, and plugins.",
  "project_state.json": "Project metadata describing current features, known issues, and state for the fullscreen image preview fix."
}