{
  "backend/main.mo": "Motoko canister implementing user profiles plus per-user note CRUD with access control and blob image references.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components with confidence metadata.",
  "frontend-file-summaries.txt": "Text mapping frontend file paths to short human-written summaries of each component or utility.",
  "frontend/index.css": "Tailwind CSS definitions for global styles and dark-mode color tokens using OKLCH values.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React app that enforces Internet Identity login, loads user profiles, forces dark mode, and shows profile setup or dashboard.",
  "frontend/src/components/FullScreenImageModal.tsx": "Modal for displaying a fullscreen image with backdrop click and close button.",
  "frontend/src/components/NoteCard.tsx": "Card component showing a note preview with edit/delete actions, timestamp, and optional encrypted indicator.",
  "frontend/src/components/NoteDetailModal.tsx": "Note detail modal supporting decryption UI, image viewing, edit/delete, and timestamp display.",
  "frontend/src/components/NoteFormModal.tsx": "Modal for creating or editing notes with encryption, text import, and image attachments.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for entering and saving a user's display name during initial profile setup.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity and triggers query invalidation when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider handling Internet Identity login, stored identities, and auth-client setup.",
  "frontend/src/hooks/useNotes.ts": "Hooks for listing, fetching, creating, updating, and deleting notes via the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Hooks for fetching and saving the caller's user profile using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup with theme variables, dark mode values, and base styling.",
  "frontend/src/main.tsx": "Entry point rendering the app and wrapping it with React Query and Internet Identity providers.",
  "frontend/src/screens/LoginScreen.tsx": "Login screen prompting the user to authenticate with Internet Identity.",
  "frontend/src/screens/NotesDashboard.tsx": "Main dashboard showing search, list of notes, and modals for viewing or editing notes.",
  "frontend/src/utils/cryptoNotes.ts": "Provides password-based AES-GCM encryption/decryption using PBKDF2 with salt and IV handling.",
  "frontend/src/utils/imageAttachments.ts": "Validates image files by type and size and generates data URL previews via FileReader.",
  "frontend/src/utils/noteSearch.ts": "Filters notes by checking case-insensitive matches in title or content.",
  "frontend/src/utils/txtImport.ts": "Reads plain text files (.txt) and returns their contents using FileReader.",
  "frontend/src/utils/urlParams.ts": "Manages URL and sessionStorage parameters, supporting hash-based routing and persistence.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, typography, animations, and container settings.",
  "project_state.json": "Project metadata describing features, architecture, issues, and image requirements for the notes app."
}