{
  "kind": "build_request",
  "title": "Fix fullscreen image preview dismissal bug (close button and backdrop click)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the fullscreen image preview overlay so it can always be dismissed when viewing an attached image: (a) clicking the preview close (X) button must close the fullscreen preview, and (b) clicking the backdrop/outside the image must close the fullscreen preview.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The bug is still present"
        ]
      },
      "acceptanceCriteria": [
        "From NoteDetailModal, open any attached image into the fullscreen preview and verify clicking the X button closes the fullscreen preview immediately.",
        "From NoteDetailModal, open any attached image into the fullscreen preview and verify clicking the darkened backdrop area (outside the image) closes the fullscreen preview immediately.",
        "Closing the fullscreen preview must not require multiple clicks and must work consistently across repeated open/close cycles."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the fullscreen image preview overlay is the topmost interactive layer while open, so pointer/click events reach the fullscreen preview close controls (i.e., underlying Dialog/overlays must not intercept clicks intended for the fullscreen preview).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The bug is still present"
        ]
      },
      "acceptanceCriteria": [
        "While the fullscreen preview is open, clicking the X button triggers the fullscreen preview onClose behavior every time (no dead/unresponsive button).",
        "While the fullscreen preview is open, clicking the backdrop triggers the fullscreen preview onClose behavior every time (no click-through to the underlying NoteDetailModal).",
        "After closing the fullscreen preview, the underlying NoteDetailModal remains open and interactive."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify and keep correct keyboard dismissal behavior: pressing Escape while the fullscreen image preview is open must close only the fullscreen preview overlay and must not close the underlying NoteDetailModal.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The bug is still present"
        ]
      },
      "acceptanceCriteria": [
        "With the fullscreen preview open, pressing Escape closes the fullscreen preview.",
        "After pressing Escape to close the fullscreen preview, the NoteDetailModal is still open (it does not dismiss).",
        "With only the NoteDetailModal open (no fullscreen preview), pressing Escape continues to behave as it did previously for the NoteDetailModal."
      ]
    }
  ],
  "constraints": [
    "Frontend changes must not edit files under frontend/src/components/ui (compose them instead).",
    "Keep all user-facing text in English."
  ],
  "nonGoals": [
    "Adding new note features unrelated to image preview dismissal.",
    "Changing backend behavior or data models (this bug should be addressed in the frontend unless a clear backend cause is discovered)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}