{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix fullscreen image preview dismissal and interaction layering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make fullscreen image preview reliably dismissible via the close (X) button and by clicking the backdrop/outside the image.",
      "acceptanceCriteria": [
        "From NoteDetailModal, open any attached image into the fullscreen preview and verify clicking the X button closes the fullscreen preview immediately.",
        "From NoteDetailModal, open any attached image into the fullscreen preview and verify clicking the darkened backdrop area (outside the image) closes the fullscreen preview immediately.",
        "Closing the fullscreen preview must not require multiple clicks and must work consistently across repeated open/close cycles."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullScreenImageModal.tsx",
          "operation": "modify",
          "description": "Harden dismissal interactions: ensure the close (X) button always triggers onClose (e.g., explicit type=\"button\", stopPropagation on pointer events), and make backdrop dismissal robust by handling pointer-down/click only when the backdrop itself is targeted (no child clicks)."
        },
        {
          "path": "frontend/src/components/NoteDetailModal.tsx",
          "operation": "modify",
          "description": "Confirm the fullscreen preview onClose reliably clears selectedImage and that image thumbnail clicks consistently set selectedImage to open the fullscreen preview."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Ensure the fullscreen image preview overlay is the topmost interactive layer so underlying dialogs/overlays cannot intercept clicks.",
      "acceptanceCriteria": [
        "While the fullscreen preview is open, clicking the X button triggers the fullscreen preview onClose behavior every time (no dead/unresponsive button).",
        "While the fullscreen preview is open, clicking the backdrop triggers the fullscreen preview onClose behavior every time (no click-through to the underlying NoteDetailModal).",
        "After closing the fullscreen preview, the underlying NoteDetailModal remains open and interactive."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullScreenImageModal.tsx",
          "operation": "modify",
          "description": "Raise and stabilize overlay stacking and event handling: increase the modal/backdrop z-index to be above Radix/shadcn Dialog layers, ensure the overlay container receives pointer events, and prevent click-through by stopping propagation on the overlay root and controls."
        },
        {
          "path": "frontend/src/components/NoteDetailModal.tsx",
          "operation": "modify",
          "description": "While fullscreen preview is open, optionally reduce/disable underlying DialogContent pointer events (e.g., conditional class) to guarantee clicks cannot be intercepted by the NoteDetailModal layer, without closing the dialog."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Maintain correct keyboard dismissal: Escape closes only the fullscreen preview and does not close the underlying NoteDetailModal.",
      "acceptanceCriteria": [
        "With the fullscreen preview open, pressing Escape closes the fullscreen preview.",
        "After pressing Escape to close the fullscreen preview, the NoteDetailModal is still open (it does not dismiss).",
        "With only the NoteDetailModal open (no fullscreen preview), pressing Escape continues to behave as it did previously for the NoteDetailModal."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/FullScreenImageModal.tsx",
          "operation": "modify",
          "description": "Strengthen Escape interception so it consistently closes only the fullscreen preview: keep the keydown listener in capture phase and prevent downstream handlers (including any stopImmediatePropagation-compatible handling) from also acting on Escape."
        },
        {
          "path": "frontend/src/components/NoteDetailModal.tsx",
          "operation": "modify",
          "description": "Preserve existing protected close logic by ensuring the dialog's onOpenChange continues to ignore close attempts while selectedImage is set, so NoteDetailModal never dismisses as a side-effect of closing the fullscreen preview."
        }
      ]
    }
  ]
}